Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Education and training supports Find out about the various ways of continuing your education, furthering your training and acquiring new skills
ga: Overview Document Traenáil agus oideachas leanúnach Cur síos ar na bealaigh chun leanacht ar aghaidh le do chuid oideachais agus do chuid traenála praiticiúil a fheabhsú, seachas dul trí chóras na scoile agus córas na gcoláistí

source: Post Leaving Certificate (PLC) courses offer a mixture of practical work, academic work and work experience to school leavers and adult participants
ga: Tá eolas anseo ar chúrsaí IAT, céard atá iontu, iaratais, liúntaisí agus cé atá i dteideal an cúrsa a dhéanamh

source: Youthreach provides opportunities for people who left school without formal qualifications to build on their basic education and improve work skills
ga: Cur síos ar an gclár Youthreach - eolas ar na hábhair, ar fhad an chúrsa agus ar na hionaid

source: Further Education and Training (FET) courses
ga: Cúrsaí oiliúna Breisoideachais agus Oiliúna (BOO)

source: Information about Further Education and Training (FET) training courses provided in Education and Training Board Training Centres, including eligibility conditions and allowances
ga: Cur síos ar an Cúrsaí Breisoideachais agus Oiliúna (FET), suíomhanna na gcúrsaí, intofacht, agus na liúntais atá ar fáil

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)

source: If you get a place on a Further Education and Training (FET) training course you may be paid an allowance for the duration of your course
ga: Má fhaigheann tú áit ar Cúrsaí Breisoideachais agus Oiliúna (FET) d'fhéadfá liúntas ar feadh an chúrsa a bheith íoctha leat

source: Childcare during vocational training
ga: Cúram Leanaí le linn cúrsaí gairmoiliúna

source: You may qualify for a subsidised childcare place, if you are attending certain types of vocational training provided by an Education and Training Board (ETB), Momentum or Community Employment
ga: Tá scéim chúraim leanaí ann do dhaoine atá ag freastal ar chlár oiliúna gairme de chuid FÁS

source: Skills training linked to national development
ga: Scileanna traenála náscaithe le comhlucht náisiúnta

source: This document describes the training available through Government funded agencies linked to the commercial or the industrial sector
ga: Deánann an doiciméad seo cur síos ar an traenáil atá ar fáil trí eagraíochtaí maoinithe Rialtais náscaithe le rannóg tionsclaíochta agus trádála

source: Life skills training for people with vision impairments
ga: Bunchúrsa do dhaoine le lagú amhairc

source: This course for people with vision impairments is run by the National Council for the Blind of Ireland. It offers an individual rehabilitation programme to people with a significant degree of sight loss
ga: Tairgaíonn an cúrsa seo do dhaoine le lagú amhairc, atá dhá riaradh ag Comhairle Náisiúnta na hÉireann do na Daill, réimse oiliúna i scileanna saoil do dhaoine atá bhfuil cailliúint shuntasach de radharc na súl orthu

source: An overview of some options for school-leavers
ga: Léargas ar roinnt roghanna d'fhágóirí scoile

source: Information about apprenticeships, who is eligible for them and the allowances for participants
ga: Cuireann Momentum rochtain ar fáil ar thionscadail oideachais agus oiliúna agus ar thacaíocht saor in aisce chun lámh chúnta a thabhairt do dhaoine atá dífhostaithe le tréimhse fhada obair a fháil

source: Momentum provides access to free education and training projects to help long-term unemployed people access work
ga: Faisnéis faoi phrintíseachtaí, faoi cé atá incháilithe ina leith agus faoi liúntais do rannpháirtithe

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna
